wireshark-domainRequest.txt

Frame 11: 2242 bytes on wire (17936 bits), 1123 bytes captured (8984 bits) on interface 0
Null/Loopback
Internet Protocol Version 4, Src: 127.0.0.1, Dst: 127.0.0.1
Transmission Control Protocol, Src Port: 52800, Dst Port: 8080, Seq: 1778, Ack: 1, Len: 1079
[3 Reassembled TCP Segments (2856 bytes): #8(317), #10(1460), #11(1079)]
Hypertext Transfer Protocol
    POST /lexs-ws-jaxws-service/services/de HTTP/1.1\r\n
        [Expert Info (Chat/Sequence): POST /lexs-ws-jaxws-service/services/de HTTP/1.1\r\n]
            [POST /lexs-ws-jaxws-service/services/de HTTP/1.1\r\n]
            [Severity level: Chat]
            [Group: Sequence]
        Request Method: POST
        Request URI: /lexs-ws-jaxws-service/services/de
        Request Version: HTTP/1.1
    Accept-Encoding: gzip,deflate\r\n
    Content-Type: text/xml;charset=UTF-8\r\n
    SOAPAction: "http://lexs.justice.gov/domainexchange/5.0/domainExchangeRequest"\r\n
    Content-Length: 2539\r\n
        [Content length: 2539]
    Host: localhost:8080\r\n
    Connection: Keep-Alive\r\n
    User-Agent: Apache-HttpClient/4.1.1 (java 1.5)\r\n
    \r\n
    [Full request URI: http://localhost:8080/lexs-ws-jaxws-service/services/de]
    [HTTP request 1/1]
    [Response in frame: 20]
    File Data: 2539 bytes
eXtensible Markup Language
    <soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:lexs="http://lexs.justice.gov/lexs/5.0"
        xmlns:lexsde="http://lexs.justice.gov/domainexchange/5.0"
        xmlns:lexslib="http://lexs.justice.gov/library/5.0"
        xmlns:lexsmeta="http://lexs.justice.gov/meta/5.0"
        xmlns:nc="http://release.niem.gov/niem/niem-core/3.0/"
        xmlns:j="http://release.niem.gov/niem/domains/jxdm/5.2/">
        <soapenv:Header
            xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <lexsmeta:MessageMetadata>
                <lexsmeta:LEXSVersionNumberText>
                    5.0
                    </lexsmeta:LEXSVersionNumberText>
                <lexsmeta:MessageDateTime>
                    2001-12-17T09:30:47Z
                    </lexsmeta:MessageDateTime>
                <lexsmeta:MessageIdentifier>
                    uuid:ab19b2f2-d64c-44c6-ab18-61dde2f25e62
                    </lexsmeta:MessageIdentifier>
                <lexsmeta:DataSensitivityText>
                    SBU
                    </lexsmeta:DataSensitivityText>
                <lexs:MessageOriginIdentifier>
                    <j:OrganizationORIIdentification>
                        <nc:IdentificationID>
                            ATL123456
                            </nc:IdentificationID>
                        </j:OrganizationORIIdentification>
                    <nc:OrganizationName>
                        ATLANTA PD
                        </nc:OrganizationName>
                    <lexs:SystemID>
                        APD123
                        </lexs:SystemID>
                    </lexs:MessageOriginIdentifier>
                </lexsmeta:MessageMetadata>
            <wsa:Action>
                http://lexs.justice.gov/domainexchange/5.0/domainExchangeRequest
                </wsa:Action>
            <wsa:ReplyTo>
                <wsa:Address>
                    http://www.w3.org/2005/08/addressing/anonymous
                    </wsa:Address>
                </wsa:ReplyTo>
            <wsa:MessageID>
                uuid:bd2a0018-4798-4e4a-989e-3a375f7f5c50
                </wsa:MessageID>
            <wsa:To>
                http://localhost:8080/lexs-ws-jaxws-service/services/de
                </wsa:To>
            </soapenv:Header>
        <soapenv:Body>
            <lexsde:domainRequest>
                <lexs:DomainRequestMessage>
                    <lexs:UserAssertion>
                        <lexs:UserID>
                            am123
                            </lexs:UserID>
                        <nc:OrganizationName>
                            APD
                            </nc:OrganizationName>
                        </lexs:UserAssertion>
                    <lexs:DomainRequestMessageDomainAttribute>
                        <lexslib:DomainName>
                            http://www.w3.org/TR/xmlschema-0
                            </lexslib:DomainName>
                        <apo:purchaseOrder
                            orderDate="1999-10-20"
                            xmlns:apo="http://www.example.com/PO1">
                            <apo:shipTo
                                country="US">
                                <apo:name>
                                    Alice Smith
                                    </apo:name>
                                <apo:street>
                                    123 Maple Street
                                    </apo:street>
                                </apo:shipTo>
                            <apo:billTo
                                country="US">
                                <apo:name>
                                    Robert Smith
                                    </apo:name>
                                <apo:street>
                                    8 Oak Avenue
                                    </apo:street>
                                </apo:billTo>
                            <apo:comment>
                                Hurry, my lawn is going wild
                                </apo:comment>
                            </apo:purchaseOrder>
                        </lexs:DomainRequestMessageDomainAttribute>
                    </lexs:DomainRequestMessage>
                </lexsde:domainRequest>
            </soapenv:Body>
        </soapenv:Envelope>
